---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Angle
source: html/fc94f2f8-ac92-9974-09f0-aaff0bfc499c.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Angle Property

the angle of the fitting, Units:(rad).

## Syntax (C#)
```csharp
public double Angle { get; }
```